#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

//求Sn=a+aa+aaa+aaaa+aaaaa的前5项之和，其中a是一个数字，

//例如：2 + 22 + 222 + 2222 + 22222

//首先创建a变量
//第二位是 a*10+a
//第三位是 (a*10+a)*10+a
//规律是 Sn =0;  Sn = (a + Sn*10)
//创建一个临时变量tmp 
// Sn = Sn + tmp;
// 打印Sn


//int main()
//{
//	int a = 0;
//	scanf("%d", &a);
//	int i = 0;
//	int Sn = 0;
//	int Mul = 0;
//	for (i = 0; i < 5; i++)
//	{
//		Mul = Mul * 10 + a;
//		int tmp = Mul;
//		Sn = tmp + Sn;
//	}
//	printf("%d\n", Sn);
//	return 0;
//}


//求出0～100000之间的所有“水仙花数”并输出。
//
//“水仙花数”是指一个n位数，其各位数字的n次方之和确好等于该数本身，如 : 153＝1 ^ 3＋5 ^ 3＋3 ^ 3，则153是一个“水仙花数”。

//
//水仙花数是从三位开始
//循环100到100000
//首先判断这次的数是几位数
// a/10一直循环到a = 0;计数得到几位数
// 这个数字模10得到每一位
// 每一位数字的n次方相加
//打印结果
//
//int main()
//{
//	int i = 0;
//	int tmp1 = 0;
//	int j = 0;
//	
//	int tmp2 = 0;
//
//	for (i = 0; i < 100000; i++)
//	{
//		tmp1 = i;
//		int c = 0;
//		while (tmp1 != 0)
//		{
//			tmp1 /= 10;
//			c++;
//		}
//		tmp2 = i;
//		int sum = 0;
//		while (tmp2 != 0)
//		{
//			tmp1 = tmp2 % 10;
//			int Mul = 1;
//			for (j = 0; j < c; j++)
//			{
//				Mul *= tmp1;
//			}
//			sum += Mul;
//			tmp2 /= 10;
//		}
//		if (sum == i)
//		{
//			printf("%d ", sum);
//		}
//	}
//	return 0;
//}



//用C语言在屏幕上输出以下图案：
//
//      *
//     ***
//    *****
//   *******
//  *********
// ***********
//*************
// ***********
//  *********
//   *******
//    *****
//     ***
//      *

//先打印6个空格一个星号
//5个空格3个星
//4个空格5个星
//3      7
//2   9
//1 11
//0 13
//
// 下半部分
// 1 11
// 2 9
// 3 7
// 4 5
// 5 3
// 6 1

//int main()
//{
//	int i = 0;
//	int j = 0;
//	int n = 7;
//	for (i = 0; i < n; i++)
//	{
//		for (j = 0; j < n - 1 - i; j++)
//		{
//			printf(" ");
//		}
//		for (j = 0; j < 2 * i + 1; j++)
//		{
//			printf("*");
//		}
//		printf("\n");
//	}
//
//	for (i = 0; i < n-1; i++)
//	{
//		for (j = 0; j <= i; j++)
//		{
//			printf(" ");
//		}
//		for (j = 0; j < 2 * (n - i - 1) - 1; j++)
//		{
//			printf("*");
//		}
//		printf("\n");
//	}
//	return 0;
//}

//喝汽水，1瓶汽水1元，2个空瓶可以换一瓶汽水，给20元，可以多少汽水（编程实现）
//一元1   一瓶1  空瓶1
//2   2   2==1   3
//3   3   3==1--1   5
//4   4   4==2--0==1   7
//5   5   5换2瓶余1空瓶  2瓶换一瓶余一空瓶  2空瓶换余一空 9
//金钱所买的汽水加上可以换到的汽水（empty/2),判断换完是否有空瓶（empty%2),没有空瓶判断空瓶是否大于1瓶，有空瓶空瓶数+1判断是否大于1
//
//
//int main()
//{
//	int money = 20;
//	int soda = money;
//	int empty = soda;
//	while (empty > 1)
//	{
//		soda += empty / 2;
//		empty = empty / 2 + empty % 2;
//	}
//	printf("%d\n", soda);
//	return 0;
//}