#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
#include<Windows.h>
#include<limits.h>
#include<float.h>
//int main()
//{
//	char a = -1;
//	signed char b = -1;
//	unsigned char c = -1;
//	printf("%d %d %d ", a, b, c);
//	return 0;
//}
//10000000 00000000 00000000 00000001
//11111111 11111111 11111111 11111110
//11111111 11111111 11111111 11111111
//a ,b ,c -> 11111111
//整型提升,按符号位补
//c是无符号的char类型，无符号提升补0
 
//int main()
//{
//	char a = -128;
//	//10000000 00000000 00000000 10000000
//	//11111111 11111111 11111111 01111111
//	//11111111 11111111 11111111 10000000
//	// 
//	//11111111 11111111 11111111 10000000
//	printf("%u\n", a);
//	return 0;
//}

//int main()
//{
//	char a = 128;
////00000000 00000000 00000000 10000000
//	printf("%u\n", a);
//	//10000000
////	//10000000 00000000 00000000 10000000
////	//11111111 11111111 11111111 01111111
////	//11111111 11111111 11111111 10000000
//	return 0;
//}

//int main()
//{
//	int i = -20;
//	//10000000 00000000 00000000 00010100
//	//11111111 11111111 11111111 11101011
//	//11111111 11111111 11111111 11101100
//	unsigned int j = 10;
//	//00000000 00000000 00000000 00001010
//
//	//11111111 11111111 11111111 11110110
//	//11111111 11111111 11111111 11110101
//	//10000000 00000000 00000000 00001010
//	printf("%d\n", i + j);
//	return 0;
//}

//int main()
//{
//	unsigned int i;
//	for (i = 9; i >=0; i--)
//	{
//		printf("%u\n", i);
//		//Sleep(1000);
//		//-1
//		//整型提升
//		//4294967295
//	}
//	return 0;
//}

//int main()
//{
//	char a[1000];
//	int i = 0;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//		//-1,-2 ... -128 ,127 ...0 ,-1
//
//		//signed char 1 byte  = 8 bit   -128~127
//		//unsigned char 1 byte = 8 bit  0 ~ 255
//		//
//		//00000000  0      0
//		// ....  
//		//01111111         127
//		//10000000  128    -128//直接解析为-128
//		//10000001         -127
//		// ....            
//		//11111111  255    -1  
//		//
//		// short 
//		// 00000000 00000000 ~ 01111111 11111111 ~11111111 11111111
//		// 0 ~ 32767 ,-32768 ~ -1
//		//
//
//	}
//	printf("%d", strlen(a));
//	return 0;
//}

//unsigned int i = 0;
//int main()
//{
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hellw world\n");
//	}
//	return 0;
//}//死循环

//浮点型在内存中的存储
//根据IEEE754 规定了浮点数
// （-1）^S * M * 2^E
// （-1）^S表示符号位，当S =0,V为正数，当S =1,V为负数
// M表示有效数字，大于等于一，小于2
// 2^E表示指数位
// 
// 对于32位的浮点数（float）,最高位一位是符号位S,接着8位是指数E,
// 剩下的23位是有效数字M
// 
// 对于64位（double) ,最高位一位是符号位S,接着11位是指数E,
// 剩下的52位是有效数字M
// 
//M位只存小数点后面的有效位
// 
// 0.5 -10进制
// 0.1-二进制
// 1.0*2^-1
// 
// E是无符号整数
// 对于8bit + 127(中间值)
// 对于11bit + 1023（中间值）
// 取出指数E时
// 1.E不全为0或不全为1时，-127或-1023
// 2.E全为0或全1 E = -127(真实值)  E=1-127或者1-1023
// 3.E全1    E= 128(真实值)   表示无穷大 
// 
// 
// 5.5
// 101.1
// 1.011*2^2
// (-1)^0 * 1.011 *2^2
// S=0  M = 1.011 E =2
// 
// 
// .1 == 2^-1
// 
 
//#include<float.h>
//
//int main()
//{
//	int n = 9;
//	//00000000 00000000 00000000 00001001
//	float* pFloat = (float*)&n;
//	//0 00000000 0000000 00000000 00001001
//	//S E        M    
//	printf("%d\n", n);
//	printf("%f\n", *pFloat);
//	*pFloat = 9.0;
//	//1001.0 == 1.001*2^3
//	//s =0 E=3 M = 1.001
//	// 	   E=3+127
//	//0 10000010 0010000 00000000 00000000
//	//0x 41 10 00 00
//	//内存中
//	//0x 00 00 10 41
//
//	printf("%d\n", n);
//	//0 10000010 001 0000 0000 0000 0000 0000
//	printf("%f\n", *pFloat);
//	return 0;
//}


//作业
//int main()
//{
//    int arr[] = { 1,2,3,4,5 };
//    //0x 01 00 00 00
//    //0x 02 00 00 00
//    //0x 03 00 00 00
//    //0x 04 00 00 00
//    //0x 05 00 00 00
//    short* p = (short*)arr;
//    //*p 指向 01
//    int i = 0;
//    for (i = 0; i < 4; i++)
//    {
//        *(p + i) = 0;
//        //short 2byte
//    //0x 00 00 00 00
//    //0x 00 00 00 00
//    //0x 03 00 00 00
//    //0x 04 00 00 00
//    //0x 05 00 00 00
//    }
//
//    for (i = 0; i < 5; i++)
//    {
//        printf("%d ", arr[i]);
//    }
//    return 0;
//}
//int main()
//{
//	unsigned long pulArray[] = { 6,7,8,9,10 };
//	unsigned long* pulPtr;
//	pulPtr = pulArray;
//	*(pulPtr + 3) += 3;//12
//	printf("%u, %u\n", *pulPtr, *(pulPtr + 3));
//	return 0;
//}
